#+title:  Chapter 3
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:python :session *chapter-3* :tangle chapter_3.py

#+toc: headlines 2

*** Proof
It is clear that a polynomial-time algorithm for finding the factors of a number suffices
to solve the decision problem in polynomial time. Thus we only have to prove one direction
of the equivalence.

Let $(x,t)\mapsto\mathrm{factp}(x,t)$ be a polynomial time (in the number of bits of $x$)
algorithm to solve the decision problem. We have to prove that in this case a
polynomial-time algorithm for finding the factors exists.

We first give an algorithm to compute the /smallest/ divisor of $x$. The function takes
=factp= as a callback. It solves a slightly more general problem to have a cleaner
statement what the function does. See the docstring for the details:

#+name: exercise-3.17-1
#+begin_src python
  def find_largest_if_not(x: int, factp: Callable[[int, int], bool]) -> int:
      """Find the largest integer 1<=d<=x such that factp(x, l) is false.
      Return 1 if none exists.

      Preconditions:
        - x >= 1
        - factp(x, l) is defined for l=1,...,x
        - If factp(x, l) is true for some l then so is factp(x, l+1)
        - Either factp(x, l) is true of all l>sqrt(x) or it is always false.

      In case of the factor problem factp(x, l) is true if x has a non-trivial divisor strictly
      smaller than l.

      Note: The third precondition is stricter than needed but it is satisfied for the
      factor problem."""
      if x == 1:  # corner case
          return 1

      # Find the smallest power of two for which factp is true (if it exists)
      k = 1
      while not factp(x, 2**k):
          k = k + 1
          if 2**k > x:
              # Here x is prime if factp is decides the Factor problem. In the general case
              # we rely on the third precondition here!
              return x

      # Here x is not prime if factp decides the Factor problem.

      # d *will* be the smallest number with the desired property. Right now only the left
      # most bit is correct. The following loop builds up d bit by bit.
      d = 2**(k-1)

      for i in range(k-2, -1, -1):
          d1 = d + 2**i
          if factp(x, d1):
              d = d  # just for explicity
          else:
              d = d1

      return d
#+end_src

Let $n=O(\log(x))$ be the number of bits of $x$. Let $f(n)=\Omega(n)$ be a function such
that =factp= runs in $O(f(n))$ steps. Note that all /basic/ arithmetic operations, within
the above function are (theoretically) $O(n)$ since the numbers involved are not larger
then $2x$ and we only add or multiply by the very peculiar number two which works nice
with binary numbers (we could easily avoid the powers of two but I kept them for
readability).

This algorithm calls =factp= around $O(n)$ times and hence runs in $O(nf(n))$
steps. Clearly the number $x$ has at most $\log_2(x)=O(n)$ factors. Hence it suffices to
call this procedure $O(n)$ times to compute all factors in $O(n^2f(n))$ steps. QED,

Let us do a tiny non-systematic experiment - just having some fun with the above
algorithm.  To generate the primes I used [[https://bigprimes.org/][bigprimes.org]] which claims to generate /true/
primes with high probability. On the other hand, note that we do not really use the fact
that these numbers are prime (due to our fake implementation of =factp=):

#+name: exercise-3.17-2
#+begin_src python :results replace output :tangle no :cache yes
  # We assume that the first prime in each tuple is the smallest
  prime_tuples = [
    (34129,
     63907),
    (7081163707,
     8680787539),
    (6388797743,
     6725672819,
     6388797743),
    (53935348593314365769,
     90916509983980640933),
    (312242331938588645593029053519,
     75189371683335785392960817804971969),
    (85885984977628802697002710823722671231249625512539,
     173202242859416728004553100028078327188834835916135376079867),
    (16454682855571279030686449830860047,
     26432071998531033907383391746862621,
     68404929161253247874640503692598161,
     77570673742199569337801762624138099,
     80645260483118874221181403055241113),
  ]

  for primes in prime_tuples:
      x = reduce((lambda a, b: a*b), primes, 1)
      count_calls_to_factp = 0

      def factp_fake(x, l):
          global count_calls_to_factp
          count_calls_to_factp += 1
          return l > primes[0]

      assert find_largest_if_not(x, factp_fake) == primes[0]
      print(f"Called factp {count_calls_to_factp} times for "\
      f"{x.bit_length()} bit number with {len(primes)} prime factors.")
#+end_src

#+RESULTS[e4276e7b4171672724cc6592e346639372db9c78]: exercise-3.17-2
: Called factp 31 times for 32 bit number with 2 prime factors.
: Called factp 65 times for 66 bit number with 2 prime factors.
: Called factp 65 times for 98 bit number with 3 prime factors.
: Called factp 131 times for 132 bit number with 2 prime factors.
: Called factp 195 times for 214 bit number with 2 prime factors.
: Called factp 331 times for 363 bit number with 2 prime factors.
: Called factp 227 times for 576 bit number with 5 prime factors.

As expected, the number of calls to =factp= is roughly the number of bits of =x=. The
worst case is when the number is a product of nearly equal prime numbers (of course, =x=
being prime is even worse but this case is excluded above). If this is not the case the
required number of calls can be much smaller.

